/*Вычислить среднюю цену и суммарную стоимость тех книг, количество экземпляров которых принадлежит интервалу от 5 до 14, включительно. 
Столбцы назвать Средняя_цена и Стоимость, значения округлить до 2-х знаков после запятой*/

/*WHERE фильтрует строки, HAVING - группы.*/

SELECT ROUND(AVG(price),2) as Средняя_цена , ROUND(SUM(price*amount),2) as Стоимость 
FROM book 
WHERE amount BETWEEN 5 AND 14


/*Вывести максимальную и минимальную цену книг каждого автора, кроме Есенина, количество экземпляров книг которого больше 10. */
/*1-вариант*/
SELECT author,
    MIN(price) AS Минимальная_цeна,
    MAX(price) AS Максимальная_цена
FROM book
WHERE author <> 'Есенин С.А.'
GROUP BY author
HAVING SUM(amount) > 10;
/*2-вариант*/
SELECT author,
    MIN(price) AS Минимальная_цена,
    MAX(price) AS Максимальная_цена
FROM book
GROUP BY author
HAVING SUM(amount) > 10 AND author <> 'Есенин С.А.';

/*Не смотря на то что результат будет одинаковым, так делать не рекомендуется. 
«Потому что как написано - запрос сначала выбирает всех авторов, потом выводит данные, 
рассчитывая минимальное и максимальное значение цены для каждого, и только после всего убирает Есенина.
Можно убрать Есенина в данном случае раньше и не использовать ресурсы базы для расчета его минимального и максимального значения,
как это сделано в первом варианте. На небольшой базе быстродействия не ощутить, но если выполнять такое на продуктивной, 
то второй вариант значительно проигрывает...»*/


/*Посчитать стоимость всех экземпляров каждого автора без учета книг «Идиот» и «Белая гвардия». 
В результат включить только тех авторов, у которых суммарная стоимость книг (без учета книг «Идиот» и «Белая гвардия») 
более 5000 руб. Вычисляемый столбец назвать Стоимость. Результат отсортировать по убыванию стоимости.*/

SELECT author, SUM(price*amount) as Стоимость
FROM book
WHERE title <> 'Идиот' and title <> 'Белая гвардия'
GROUP BY author
HAVING Стоимость >= 5000
ORDER BY Стоимость desc